# YOLOv12n + P2 Head + CARAFE (Ablation 2)
# Adds P2 detection head + CARAFE upsampling (no DCNv3, no special attention modules)
# 
# Purpose: Measure effect of CARAFE on top of P2 head
# Detection scales: P2 (4x), P3 (8x), P4 (16x), P5 (32x)
# Includes: A2C2f blocks in backbone, CARAFE upsampling in head

# Parameters
nc: 3  # number of classes: rbc, wbc, platelet
scales:
  n: [0.50, 0.25, 1024]  # depth, width, max_channels

# YOLOv12n backbone with area-attention
backbone:
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4  
  - [-1, 2, C3k2, [256, False, 0.25]] # 2-P2 features
  - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4-P3 features
  - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
  - [-1, 4, A2C2f, [512, True]]       # 6-P4 with area-attention
  - [-1, 1, Conv, [1024, 3, 2]]       # 7-P5/32
  - [-1, 4, A2C2f, [1024, True]]      # 8-P5 with area-attention

# Head: Four-scale detection with CARAFE upsampling (replaces standard Upsample)
head:
  # --- Top-down path with CARAFE upsampling ---
  - [-1, 1, CARAFE, [1024]]                     # 9-CARAFE P5->P4
  - [[-1, 6], 1, Concat, [1]]                   # 10-Fuse P5+P4
  - [-1, 2, A2C2f, [512, False, -1]]            # 11-Enhanced P4 features

  - [-1, 1, CARAFE, [512]]                      # 12-CARAFE P4->P3  
  - [[-1, 4], 1, Concat, [1]]                   # 13-Fuse P4+P3
  - [-1, 2, A2C2f, [256, False, -1]]            # 14-Enhanced P3 features

  - [-1, 1, CARAFE, [256]]                      # 15-CARAFE P3->P2
  - [[-1, 2], 1, Concat, [1]]                   # 16-Fuse P3+P2  
  - [-1, 2, A2C2f, [256, False, -1]]            # 17-Enhanced P2 features (no attention module)

  # --- Bottom-up path ---
  - [-1, 1, Conv, [128, 3, 2]]                  # 18-P2->P3 transition
  - [[-1, 14], 1, Concat, [1]]                  # 19-Fuse with P3
  - [-1, 2, A2C2f, [256, False, -1]]            # 20-P3 detection head

  - [-1, 1, Conv, [256, 3, 2]]                  # 21-P3->P4 transition  
  - [[-1, 11], 1, Concat, [1]]                  # 22-Fuse with P4
  - [-1, 2, A2C2f, [512, False, -1]]            # 23-P4 detection head

  - [-1, 1, Conv, [512, 3, 2]]                  # 24-P4->P5 transition
  - [[-1, 8], 1, Concat, [1]]                   # 25-Fuse with P5  
  - [-1, 2, C3k2, [1024, True]]                 # 26-P5 detection head

  # Four-scale detection: P2 + P3 + P4 + P5
  - [[17, 20, 23, 26], 1, Detect, [nc]]         # 27-Detection head
