# YOLOv12n + P2 Head (Ablation 1)
# Adds P2 detection head to YOLOv12n baseline
# 
# Purpose: Measure effect of P2 head alone (without CARAFE, DCNv3, special attention)
# Detection scales: P2 (4x), P3 (8x), P4 (16x), P5 (32x)
# Includes: A2C2f blocks in backbone only, standard upsampling (no CARAFE)

# Parameters
nc: 3  # number of classes: rbc, wbc, platelet
scales:
  n: [0.50, 0.25, 1024]  # depth, width, max_channels

# YOLOv12n backbone with area-attention
backbone:
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4  
  - [-1, 2, C3k2, [256, False, 0.25]] # 2-P2 features (now used for P2 detection)
  - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4-P3 features
  - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
  - [-1, 4, A2C2f, [512, True]]       # 6-P4 with area-attention
  - [-1, 1, Conv, [1024, 3, 2]]       # 7-P5/32
  - [-1, 4, A2C2f, [1024, True]]      # 8-P5 with area-attention

# Head: Four-scale detection P2, P3, P4, P5 with standard upsampling
head:
  # --- Top-down path (standard upsampling, no CARAFE) ---
  - [-1, 1, Conv, [512, 3, 1]]                # 9-P5 transition
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 10-Upsample P5->P4
  - [[-1, 6], 1, Concat, [1]]                # 11-Fuse with P4
  - [-1, 2, A2C2f, [512, False, -1]]         # 12-Enhanced P4

  - [-1, 1, Conv, [256, 3, 1]]               # 13-P4 transition
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 14-Upsample P4->P3
  - [[-1, 4], 1, Concat, [1]]                # 15-Fuse with P3
  - [-1, 2, A2C2f, [256, False, -1]]         # 16-Enhanced P3

  - [-1, 1, Conv, [128, 3, 1]]               # 17-P3 transition
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 18-Upsample P3->P2
  - [[-1, 2], 1, Concat, [1]]                # 19-Fuse with P2
  - [-1, 2, A2C2f, [256, False, -1]]         # 20-Enhanced P2 (no special attention module)

  - [-1, 1, Conv, [128, 3, 2]]               # 21-P2->P3
  - [[-1, 16], 1, Concat, [1]]               # 22-Fuse with P3
  - [-1, 2, A2C2f, [256, False, -1]]         # 23-P3 detection head

  - [-1, 1, Conv, [256, 3, 2]]               # 24-P3->P4
  - [[-1, 12], 1, Concat, [1]]               # 25-Fuse with P4
  - [-1, 2, A2C2f, [512, False, -1]]         # 26-P4 detection head

  - [-1, 1, Conv, [512, 3, 2]]               # 27-P4->P5
  - [[-1, 8], 1, Concat, [1]]                # 28-Fuse with P5
  - [-1, 2, C3k2, [1024, True]]              # 29-P5 detection head

  # Four-scale detection: P2 + P3 + P4 + P5
  - [[20, 23, 26, 29], 1, Detect, [nc]]      # 30-Detection head
