# TOAM-YOLO + Spatial Attention Only (TOA-MoE Ablation - No Experts)
# Full architecture but with simplified spatial attention instead of TOA-MoE
# 
# Purpose: Measure effect of multi-domain experts (Hessian + Fourier)
# This replaces TinyObjectAttentionMOE with a simpler SpatialAttention baseline
# Detection scales: P2 (4x), P3 (8x), P4 (16x), P5 (32x)
#
# NOTE: This requires code modification in block.py:
# Replace TinyObjectAttentionMOE at line 17 with a simpler SpatialAttention module
# or create a config parameter to disable MoE routing in TinyObjectAttentionMOE

# Parameters
nc: 3  # number of classes: rbc, wbc, platelet
scales:
  n: [0.50, 0.25, 1024]  # depth, width, max_channels

# YOLOv12n backbone with area-attention (identical to TOAM-YOLO)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4  
  - [-1, 2, C3k2, [256, False, 0.25]] # 2-P2 features
  - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4-P3 features
  - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
  - [-1, 4, A2C2f, [512, True]]       # 6-P4 with area-attention
  - [-1, 1, Conv, [1024, 3, 2]]       # 7-P5/32
  - [-1, 4, A2C2f, [1024, True]]      # 8-P5 with area-attention

# Head: Identical to TOAM-YOLO but with simplified attention at P2
head:
  # --- Top-down path with CARAFE upsampling ---
  - [-1, 1, CARAFE, [1024]]                     # 9-CARAFE P5->P4
  - [[-1, 6], 1, Concat, [1]]                   # 10-Fuse P5+P4
  - [-1, 2, A2C2f, [512, False, -1]]            # 11-Enhanced P4 features

  - [-1, 1, CARAFE, [512]]                      # 12-CARAFE P4->P3  
  - [[-1, 4], 1, Concat, [1]]                   # 13-Fuse P4+P3
  - [-1, 2, A2C2f, [256, False, -1]]            # 14-Enhanced P3 features

  - [-1, 1, CARAFE, [256]]                      # 15-CARAFE P3->P2
  - [[-1, 2], 1, Concat, [1]]                   # 16-Fuse P3+P2  
  - [-1, 1, SpatialAttention, [256]]            # 17-SPATIAL ATTENTION ONLY (not TOA-MoE)
  - [-1, 2, A2C2f, [256, False, -1]]            # 18-P2 detection head

  # --- Bottom-up path with BiFPN-style enhancement ---
  - [-1, 1, Conv, [128, 3, 2]]                  # 19-P2->P3 transition
  
  # BiFPN-style cross-scale connection: P3_bottom + P3_top + P3_backbone
  - [[-1, 14, 4], 1, Concat, [1]]               # 20-Triple P3 fusion
  
  - [-1, 2, A2C2f, [256, False, -1]]            # 21-P3 detection head

  - [-1, 1, Conv, [256, 3, 2]]                  # 22-P3->P4 transition
  - [[-1, 11], 1, Concat, [1]]                  # 23-Fuse with P4
  - [-1, 2, C2f_DCNV3, [512, True]]             # 24-P4 with DCNv3

  - [-1, 1, Conv, [512, 3, 2]]                  # 25-P4->P5 transition
  - [[-1, 8], 1, Concat, [1]]                   # 26-Fuse with P5
  - [-1, 2, C2f_DCNV3, [1024, True]]            # 27-P5 with DCNv3

  # Four-scale detection
  - [[18, 21, 24, 27], 1, Detect, [nc]]         # 28-Detection head

# Note: To use this file, the block.py TinyObjectAttentionMOE module must be
# parameterized or a new "SpatialAttention" module needs to be registered in models/detect.py
