# TOAM-YOLO + No MoE Routing (TOA-MoE Routing Ablation)
# Full TOAM-YOLO architecture with TOA-MoE but experts equally weighted (no learned routing)
# 
# Purpose: Measure benefit of learned routing via MoE gating mechanism
# All experts (Spatial, Fourier, Hessian) weighted equally: 1/3 each
# Detection scales: P2 (4x), P3 (8x), P4 (16x), P5 (32x)
#
# NOTE: This requires code modification in block.py TinyObjectAttentionMOE:
# In the forward pass, replace the learned routing with uniform routing:
#   # Instead of:
#   # routing_logits = self.router(x)
#   # routing_weights = torch.softmax(routing_logits, dim=1)
#   # Use uniform weighting:
#   routing_weights = torch.ones(x.shape[0], 3, 1, 1) / 3.0
# Alternatively, add a config param: use_moe_routing=False

# Parameters
nc: 3  # number of classes: rbc, wbc, platelet
scales:
  n: [0.50, 0.25, 1024]  # depth, width, max_channels

# YOLOv12n backbone (identical to TOAM-YOLO)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4  
  - [-1, 2, C3k2, [256, False, 0.25]] # 2-P2 features
  - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4-P3 features
  - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
  - [-1, 4, A2C2f, [512, True]]       # 6-P4 with area-attention
  - [-1, 1, Conv, [1024, 3, 2]]       # 7-P5/32
  - [-1, 4, A2C2f, [1024, True]]      # 8-P5 with area-attention

# Head: Identical to TOAM-YOLO with equal-weight MoE (no routing)
head:
  # --- Top-down path with CARAFE upsampling ---
  - [-1, 1, CARAFE, [1024]]                     # 9-CARAFE P5->P4
  - [[-1, 6], 1, Concat, [1]]                   # 10-Fuse P5+P4
  - [-1, 2, A2C2f, [512, False, -1]]            # 11-Enhanced P4 features

  - [-1, 1, CARAFE, [512]]                      # 12-CARAFE P4->P3  
  - [[-1, 4], 1, Concat, [1]]                   # 13-Fuse P4+P3
  - [-1, 2, A2C2f, [256, False, -1]]            # 14-Enhanced P3 features

  - [-1, 1, CARAFE, [256]]                      # 15-CARAFE P3->P2
  - [[-1, 2], 1, Concat, [1]]                   # 16-Fuse P3+P2  
  - [-1, 1, TinyObjectAttentionMOE, [512, 256]] # 17-TOA-MoE: EQUAL WEIGHTING (no routing)
  - [-1, 2, A2C2f, [256, False, -1]]            # 18-P2 detection head

  # --- Bottom-up path with BiFPN-style enhancement ---
  - [-1, 1, Conv, [128, 3, 2]]                  # 19-P2->P3 transition
  
  # BiFPN-style cross-scale connection
  - [[-1, 14, 4], 1, Concat, [1]]               # 20-Triple P3 fusion
  
  - [-1, 2, A2C2f, [256, False, -1]]            # 21-P3 detection head

  - [-1, 1, Conv, [256, 3, 2]]                  # 22-P3->P4 transition
  - [[-1, 11], 1, Concat, [1]]                  # 23-Fuse with P4
  - [-1, 2, C2f_DCNV3, [512, True]]             # 24-P4 with DCNv3

  - [-1, 1, Conv, [512, 3, 2]]                  # 25-P4->P5 transition
  - [[-1, 8], 1, Concat, [1]]                   # 26-Fuse with P5
  - [-1, 2, C2f_DCNV3, [1024, True]]            # 27-P5 with DCNv3

  # Four-scale detection
  - [[18, 21, 24, 27], 1, Detect, [nc]]         # 28-Detection head

# Notes:
# 1. This measures the contribution of learned MoE routing vs uniform weighting
# 2. Compare results with: toam-yolo.yaml (learned routing), toe-yolo.yaml (no MoE)
# 3. Expected: toam-yolo > toam-yolo-no-moe-routing > toe-yolo (cascading ablation)
# 4. Implementation: In block.py TinyObjectAttentionMOE.forward(), add condition:
#      if use_moe_routing:
#          routing_weights = torch.softmax(self.router(x), dim=1)
#      else:
#          B, C, H, W = x.shape
#          routing_weights = torch.ones(B, 3, 1, 1, device=x.device) / 3.0
