# YOLOv11-TOAM: Default YOLOv11 backbone with TOAM-YOLO enhancements
# Ablation study: Testing TOAM modules on YOLOv11 architecture
#
# TOAM Enhancements:
# 1. CARAFE upsampling (replaces nn.Upsample)
# 2. TinyObjectAttentionMOE at P2 level
# 3. C2f_DCNV3 at P4/P5 bottom-up path
# 4. BiFPN-style triple concat at  P3
# 5. 4-scale detection (P2, P3, P4, P5)

# Parameters
# depth_multiple: 0.5
# width_multiple: 0.5
# max_channels: 1024

nc: 3  # number of classes: rbc, wbc, platelet
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLOv11 backbone (unchanged)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2-P2 features (256ch)
  - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4-P3 features (512ch)
  - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
  - [-1, 2, C3k2, [512, True]]        # 6-P4 features (512ch)
  - [-1, 1, Conv, [1024, 3, 2]]       # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]       # 8
  - [-1, 1, SPPF, [1024, 5]]          # 9
  - [-1, 2, C2PSA, [1024]]            # 10-P5 features (1024ch)

# TOAM-enhanced head
head:
  # --- Top-down path with CARAFE upsampling ---
  - [-1, 1, CARAFE, [1024]]                     # 11-CARAFE P5->P4
  - [[-1, 6], 1, Concat, [1]]                   # 12-Fuse P5+P4
  - [-1, 2, C3k2, [512, False]]                 # 13-P4 features

  - [-1, 1, CARAFE, [512]]                      # 14-CARAFE P4->P3
  - [[-1, 4], 1, Concat, [1]]                   # 15-Fuse P4+P3
  - [-1, 2, C3k2, [256, False]]                 # 16-P3 features

  - [-1, 1, CARAFE, [256]]                      # 17-CARAFE P3->P2
  - [[-1, 2], 1, Concat, [1]]                   # 18-Fuse P3+P2 (256+256=512ch)
  - [-1, 1, TinyObjectAttentionMOE, [512, 256]] # 19-TOA-MoE (c1=512 auto, c2=256)
  - [-1, 2, C3k2, [256, False]]                 # 20-P2/4 detection head

  # --- Bottom-up path with BiFPN-style enhancement ---
  - [-1, 1, Conv, [128, 3, 2]]                  # 21-P2->P3 transition

  # BiFPN: P3_bottom-up + P3_top-down + P3_backbone
  - [[-1, 16, 4], 1, Concat, [1]]               # 22-Triple P3 fusion (128+256+512=896ch)

  - [-1, 2, C3k2, [256, False]]                 # 23-P3/8 detection head

  - [-1, 1, Conv, [256, 3, 2]]                  # 24-P3->P4 transition
  - [[-1, 13], 1, Concat, [1]]                  # 25-Fuse with P4 features
  - [-1, 2, C2f_DCNV3, [512, True]]             # 26-P4/16 with DCNv3

  - [-1, 1, Conv, [512, 3, 2]]                  # 27-P4->P5 transition
  - [[-1, 10], 1, Concat, [1]]                  # 28-Fuse with P5 features (C2PSA)
  - [-1, 2, C2f_DCNV3, [1024, True]]            # 29-P5/32 with DCNv3

  # Four-scale detection: P2(tiny) + P3(small) + P4(medium) + P5(large)
  - [[20, 23, 26, 29], 1, Detect, [nc]]         # 30-Multi-scale detection head
