# TOE-YOLO: Tiny Object Enhanced YOLO (Ablation Study)
# TOAM-YOLO framework WITHOUT the TOA-MoE module for ablation analysis
#
# Components Included:
# 1. CARAFE Upsampling: Content-aware feature reassembly
# 2. DCNv3 Integration: Deformable convolutions for spatial adaptability  
# 3. BiFPN-style Connection: Enhanced cross-scale feature fusion
# 4. A2C2f Blocks: Area-attention enhanced feature extraction
#
# Components Excluded:
# - TinyObjectAttentionMOE: Replaced with simplified TinyObjectAttention
#
# Purpose: Evaluate contribution of TOA-MoE module in ablation study
# Reference: TOAM-YOLO paper - Ablation Study, TOE-YOLO variant

# Parameters  
nc: 3  # number of classes: rbc, wbc, platelet
scales:
  n: [0.50, 0.25, 1024]  # depth, width, max_channels

# YOLOv12n backbone (identical to TOAM-YOLO)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2-P2 features 
  - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4-P3 features
  - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
  - [-1, 4, A2C2f, [512, True]]       # 6-P4 with area-attention
  - [-1, 1, Conv, [1024, 3, 2]]       # 7-P5/32
  - [-1, 4, A2C2f, [1024, True]]      # 8-P5 with area-attention

# TOE-YOLO Head: Architectural enhancements without TOA-MoE
head:
  # --- Top-down path with CARAFE ---
  - [-1, 1, CARAFE, [1024]]                     # 9-CARAFE upsampling
  - [[-1, 6], 1, Concat, [1]]                   # 10-Feature fusion
  - [-1, 2, A2C2f, [512, False, -1]]            # 11-Enhanced features

  - [-1, 1, CARAFE, [512]]                      # 12-CARAFE upsampling
  - [[-1, 4], 1, Concat, [1]]                   # 13-Feature fusion  
  - [-1, 2, A2C2f, [256, False, -1]]            # 14-Enhanced features

  - [-1, 1, CARAFE, [256]]                      # 15-CARAFE upsampling
  - [[-1, 2], 1, Concat, [1]]                   # 16-Feature fusion
  - [-1, 1, TinyObjectAttention, [512, 256]]    # 17-Simplified attention (NOT TOA-MoE)
  - [-1, 2, A2C2f, [256, False, -1]]            # 18-P2 detection head

  # --- Bottom-up path with BiFPN connection ---
  - [-1, 1, Conv, [128, 3, 2]]                  # 19-Spatial transition
  
  # BiFPN-style enhancement (same as TOAM-YOLO)
  - [[-1, 14, 4], 1, Concat, [1]]               # 20-Cross-scale connection
  
  - [-1, 2, A2C2f, [256, False, -1]]            # 21-P3 detection head

  - [-1, 1, Conv, [256, 3, 2]]                  # 22-Spatial transition  
  - [[-1, 11], 1, Concat, [1]]                  # 23-Feature fusion
  - [-1, 2, C2f_DCNV3, [512, True]]             # 24-DCNv3 integration

  - [-1, 1, Conv, [512, 3, 2]]                  # 25-Spatial transition
  - [[-1, 8], 1, Concat, [1]]                   # 26-Feature fusion  
  - [-1, 2, C3k2, [1024, True]]                 # 27-P5 detection head

  # Multi-scale detection (same architecture)
  - [[18, 21, 24, 27], 1, Detect, [nc]]         # 28-Detection head